In [11]:
import pandas as pd
import numpy as np
df = pd.DataFrame({
    'name': ['Jessica', 'Liam', 'Sophia', 'Ryan', 'Alex'],
    'gender': ['F', np.nan, np.nan, 'M', 'F'],
    'score': [89, 75, 95, np.nan, 93]
})
df

      name gender  score
0  Jessica      F   89.0
1     Liam    NaN   75.0
2   Sophia    NaN   95.0
3     Ryan      M    NaN
4     Alex      F   93.0

In [15]:
[item for i, item in df.iterrows()]

[name      Jessica
 gender          F
 score        89.0
 Name: 0, dtype: object,
 name      Liam
 gender     NaN
 score     75.0
 Name: 1, dtype: object,
 name      Sophia
 gender       NaN
 score       95.0
 Name: 2, dtype: object,
 name      Ryan
 gender       M
 score      NaN
 Name: 3, dtype: object,
 name      Alex
 gender       F
 score     93.0
 Name: 4, dtype: object]

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    5 non-null      object
 1   gender  3 non-null      object
 2   score   4 non-null      float64
dtypes: float64(1), object(2)
memory usage: 252.0+ bytes

In [5]:
df.describe()

         score
count   4.0000
mean   88.0000
std     9.0185
min    75.0000
25%    85.5000
50%    91.0000
75%    93.5000
max    95.0000

In [6]:
df['gender'].value_counts()

gender
F    2
M    1
Name: count, dtype: int64

In [2]:
print(pd.isna(df))
print(type(pd.isna(df)))
pd.isna(df).sum() # 컬럼별 True 갯수

    name  gender  score
0  False   False  False
1  False    True  False
2  False    True  False
3  False   False   True
4  False   False  False
<class 'pandas.core.frame.DataFrame'>

name      0
gender    2
score     1
dtype: int64

In [16]:
clean_df = df.dropna()
print(clean_df)
print(df)

      name gender  score
0  Jessica      F   89.0
4     Alex      F   93.0
      name gender  score
0  Jessica      F   89.0
1     Liam    NaN   75.0
2   Sophia    NaN   95.0
3     Ryan      M    NaN
4     Alex      F   93.0

In [37]:
c_df = df.dropna(subset=['name', 'score'])
c_df

      name gender  score
0  Jessica      F   89.0
1     Liam    NaN   75.0
2   Sophia    NaN   95.0
4     Alex      F   93.0

In [38]:
print(type(c_df.index))
c_df

<class 'pandas.core.indexes.base.Index'>

      name gender  score
0  Jessica      F   89.0
1     Liam    NaN   75.0
2   Sophia    NaN   95.0
4     Alex      F   93.0

In [41]:
d_df = c_df.reset_index()
print(d_df)
e_df = d_df.drop(columns=['index'])
e_df

   index     name gender  score
0      0  Jessica      F   89.0
1      1     Liam    NaN   75.0
2      2   Sophia    NaN   95.0
3      4     Alex      F   93.0

      name gender  score
0  Jessica      F   89.0
1     Liam    NaN   75.0
2   Sophia    NaN   95.0
3     Alex      F   93.0

In [43]:
df1 = df.fillna(0)
print(df1)

      name gender  score
0  Jessica      F   89.0
1     Liam      0   75.0
2   Sophia      0   95.0
3     Ryan      M    0.0
4     Alex      F   93.0

In [44]:
df_mean = df['score'].mean()
df1 = df.fillna({'gender' : 'etc', 'score' : df_mean})
df1

      name gender  score
0  Jessica      F   89.0
1     Liam    etc   75.0
2   Sophia    etc   95.0
3     Ryan      M   88.0
4     Alex      F   93.0

In [21]:
df1['gender'].value_counts()

gender
F      2
etc    2
M      1
Name: count, dtype: int64